public class Main {
    public static void main(String[] args) {
        int ticket = 23454;
        int mile = 20;

        int bonus = ticket / mile;

        System.out.println("Бонусные мили за покупку билета: " + bonus);

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}